% FIS-регулятор уровня воды в баке                        (LR_3_BakVoda.m)
%==========================================================================
clear all       % очистка памяти (leaving the workspace empty)
clc             % очистка командного окна  (Clear Command Window) 
%--------------------------------------------------------------------------
% Параметры модели
Sb = 1.0;       % [m.kv] площадь полверхности жидкости
Kz = 0.5;       % коэффициент усиления задвижки
Ki = 0.05;      % коэффициент усиления обратной связи бака

% % Вариант 1
% Sb = 10.0;   Kz = 1.0;    Ki = 0.1;   
% % Вариант 2
% Sb = 8.0;    Kz = 1.2;    Ki = 0.1;   
% % Вариант 3
% Sb = 8.0;   Kz = 0.8;    Ki = 0.2;    
% % Вариант 4
% Sb = 5.0;  Kz = 1.2;      Ki = 0.1;     
% % Вариант 5
% Sb = 5.0;   Kz = 1.2;    Ki = 1.1;    
% % Вариант 6
% Sb = 10.0;   Kz = 2.2;    Ki = 1.1;    
% % Вариант 7
% Sb = 7.0;   Kz = 2.2;    Ki = 2.1;    
% % Вариант 8
% Sb = 20.0;   Kz = 5.2;    Ki = 0.7;    
% % Вариант 9
% Sb = 16.0;   Kz = 5.2;    Ki = 0.7;    
% % Вариант 10
% Sb = 12.0;   Kz = 3.2;    Ki = 1.7;    

%--------------------------------------------------------------------------
%  Синтез FIS-регулятор уровня воды в баке 
% (регулятор создается в среде GUI Fuzzy Logic Toolbox 
%  и сохраняется на диске под именем RgUrVd.fis)
% ---------------------------------------
% fuzzy
fisREG = readfis('RgUrVd');
% fuzzy(fisREG)
% ---------------------------------------


%--------------------------------------------------------------------------
% Пример из MatLab

% open_system('sltankrule');
% sim('sltankrule',100);
% bdclose('sltankrule');